main_template = "Модель: {}\n" \
                "VIN: {}\n" \
                "Год: {}\n" \
                "Цвет: {}\n" \
                "Номер двигателя: {}\n" \
                "Рабочий объем: {}\n" \
                "Мощность: {}\n" \
                "Тип машины: {}\n"

used_template = "С {} по {} - {}. Зафиксирована операция: {}"

dtp_template = "№ происшествия: {}\n"\
                "Дата: {}\n"\
                "Тип происшествия: {}\n"\
                "Регион: {}\n"

diagnostic_template = "Номер ДК: {}\n" \
                      "Дата ДК: {}\n" \
                      "Срок действия: {}\n" \
                      "Адрес проведения: {}\n" \
                      "Показания одометра: {}"

limits_template = "Вид ограничения: {}\n" \
                  "Основание: {}\n" \
                  "Кем наложено: {}\n" \
                  "Дата наложения: {}\n" \
                  "Регион: {}\n" \
                  "Телефон иннициатора: {}"