
type = {'damage_points_O': ['V01', 'V02', 'V03', 'V04', 'V05', 'V06', 'V07',
                            'V08', 'V09'],
        'damage_points_L': ['V110', 'V111', 'V112', 'V113', 'V114', 'V115', 'V116',
                            'V117', 'V118', 'V119', 'V120', 'V121', 'V122', 'V123',
                            'V124', 'V125', 'V126', 'V210', 'V211', 'V212', 'V213',
                            'V214', 'V215', 'V216', 'V217', 'V218', 'V219', 'V220',
                            'V221', 'V222', 'V223', 'V224', 'V225', 'V226'],
        'damage_points_B': ['V130', 'V131', 'V132', 'V133', 'V134', 'V135', 'V136',
                            'V137', 'V138', 'V139', 'V140', 'V141', 'V142', 'V143',
                            'V144', 'V230', 'V233', 'V234', 'V233', 'V234', 'V235',
                            'V236', 'V237', 'V238', 'V239', 'V240', 'V241', 'V242',
                            'V243', 'V244'],
        'damage_points_M': ['V150', 'V151', 'V152', 'V153', 'V154', 'V155', 'V250',
                            'V253', 'V254', 'V253', 'V254', 'V255'],
        'damage_points_F': ['V160', 'V161', 'V162', 'V163', 'V164', 'V165', 'V166',
                            'V167', 'V168', 'V169', 'V170', 'V171', 'V172', 'V173',
                            'V174', 'V175', 'V176', 'V177', 'V178', 'V179', 'V180',
                            'V260', 'V261', 'V262', 'V263', 'V264', 'V265', 'V266',
                            'V267', 'V268', 'V269', 'V270', 'V271', 'V272', 'V273',
                            'V274', 'V275', 'V276', 'V277', 'V278', 'V279', 'V280'],
        'damage_points_D': ['V190', 'V191', 'V192', 'V193', 'V194', 'V195', 'V196',
                            'V197', 'V198', 'V199', 'V290', 'V291', 'V292', 'V293',
                            'V294', 'V295', 'V296', 'V297']
        }


# Находит нужный тип транспорта по поинтам
def find_point (point):
    first = 'V' + point[0]
    for key in type:
        find = type.get(key)
        for i in find:
            count = i.count(first)
            if count == 1:
                return key


# Трансформирует поинты как надо
def dm_points (points):
    dmp = ""
    for i in points:
        dmp = dmp + 'V' + i + " "
    return dmp
